package org.telran.lecture_11_greedy_practice.practice.gifts;

// У вас есть список людей, которым нужно подарить подарки.
// У каждого человека есть предпочтения по подаркам, выраженные в виде списка желаемых подарков.
// Каждый подарок можно подарить только одному человеку. Ваша задача - осчастливить как можно больше людей.


public class Gifts {
    public static void main(String[] args) {

    }
}
// Задание не совсем понятно... И очень много вопросов.
//1. Нужно создать ещё несколько классов?
//2. Список желаний у каждой персоны, спикок персон,список подарков...
