package org.telran.lecture_6_quick.practice2;

// "Призеры олимпиады"
// По результатам олимпиады участники награждаются дипломами.
// Набравшие одинаковые баллы получают дипломы одинаковой степени.
// Призером олимпиады считается участник, получивший диплом не хуже III степени.
// По результатам олимпиады определите количество призеров.
// Вход: массив из N натуральных чисел – результаты участников.
// Выход: одно число – число призеров.

// Пример:
// Вход
// 1 3 4 3 5 6 7 7 6 1
// Выход
// 5

public class Task06 {
    public static void main(String[] args) {
        Integer[] arr = {1, 3, 4, 3, 5, 6, 7, 7, 6, 1};

    }
}
