package org.telran.lecture_6_quick.practice1;

import java.util.Scanner;

// "Сумма с условием"
// Дан массив произвольных целых чисел
// Найти: сумму элементов списка, больших данного числа a. Значение a можно задать самостоятельно.
// Примечание: Используйте алгоритм сортировки, если нужно.

public class Task03 {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int[] numbers = {2, 4, 8, -5, 0, 7, 12, 0, -4, 10};
        System.out.print("Enter a: ");
        int a = input.nextInt();
//        ...
    }
}
